ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
#include "esp32_dual_chip_spi.h"

#include "bt_dualsense_raw_hidp.h"
#include "dual_chip_spi_proto.h"
#include "led_status.h"
#include "dualsense_parser.h"

#include "driver/gpio.h"
#include "driver/spi_slave.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include <errno.h>
#include <stdbool.h>
#include <string.h>

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR
#define CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR 0
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_TX_QUEUE_DEPTH
#define CONFIG_DS5_DUAL_CHIP_TX_QUEUE_DEPTH 4
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH
#define CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH 4
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_HOST
#define CONFIG_DS5_DUAL_CHIP_SPI_HOST 2
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_SCLK_GPIO
#define CONFIG_DS5_DUAL_CHIP_SPI_SCLK_GPIO -1
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_MOSI_GPIO
#define CONFIG_DS5_DUAL_CHIP_SPI_MOSI_GPIO -1
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_MISO_GPIO
#define CONFIG_DS5_DUAL_CHIP_SPI_MISO_GPIO -1
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_SPI_CS_GPIO
#define CONFIG_DS5_DUAL_CHIP_SPI_CS_GPIO -1
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO
#define CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO -1
#endif

#ifndef CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO
#define CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO -1
#endif

#define DS5_DUAL_CHIP_TASK_STACK 4096
#define DS5_DUAL_CHIP_SPI_TASK_STACK 4096
#define DS5_DUAL_CHIP_SPI_TRANSACTION_LEN \
    (DS5_DUAL_SPI_HEADER_LEN + DS5_DUAL_SPI_MAX_PAYLOAD)

typedef struct {
    uint8_t type;
    uint16_t flags;
    uint8_t channel;
    uint8_t priority;
    uint16_t ack_seq;
    uint32_t deadline_us;
    uint16_t len;
    bool wants_ack;
    uint8_t payload[DS5_DUAL_SPI_MAX_PAYLOAD];
} dual_chip_tx_item_t;

typedef struct {
    uint8_t type;
    uint16_t flags;
    size_t len;
    uint8_t frame[DS5_DUAL_CHIP_SPI_TRANSACTION_LEN];
} dual_chip_response_item_t;

static const char *TAG = "ds5_dual_spi";
static QueueHandle_t s_tx_queue;
#if CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR
static TaskHandle_t s_tx_task;
static TaskHandle_t s_spi_task;
static SemaphoreHandle_t s_response_lock;
static dual_chip_response_item_t s_response_queue[CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH];
static uint8_t s_response_head;
static uint8_t s_response_count;
static uint32_t s_reject_log_count;
static uint32_t s_transaction_log_count;
static uint64_t s_output_gpio_configured_mask;
DMA_ATTR static uint8_t s_spi_rx_buf[DS5_DUAL_CHIP_SPI_TRANSACTION_LEN];
DMA_ATTR static uint8_t s_spi_tx_buf[DS5_DUAL_CHIP_SPI_TRANSACTION_LEN];
#endif
static esp32_dual_chip_spi_stats_t s_stats;

#if CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR
static void note_hidp_report(uint8_t report_id)
{
    switch (report_id) {
    case 0x31:
        s_stats.hidp_tx_31++;
        break;
    case 0x32:
        s_stats.hidp_tx_32++;
        break;
    case 0x39:
        s_stats.hidp_tx_36++;
        break;
    default:
        break;
    }
}

void bt_dualsense_raw_hidp_note_tx(const uint8_t *data, size_t len, int status)
{
    if (status != 0) {
        s_stats.hidp_tx_errors++;
        s_stats.hidp_last_err = status;
        return;
    }

    s_stats.hidp_last_err = 0;
    if (data == NULL || len == 0) {
        return;
    }

    if (data[0] == (uint8_t)(0x40 | 0x03)) {
        s_stats.hidp_tx_feature_get++;
    } else if (data[0] == (uint8_t)(0x50 | 0x03)) {
        s_stats.hidp_tx_feature_set++;
    } else if (data[0] == 0xA2 && len > 1) {
        note_hidp_report(data[1]);
    } else {
        note_hidp_report(data[0]);
    }
}
#endif

static bool enqueue_latest(const dual_chip_tx_item_t *item)
{
    dual_chip_tx_item_t dropped;

    if (s_tx_queue == NULL || item == NULL) {
        return false;
    }

    if (xQueueSend(s_tx_queue, item, 0) == pdPASS) {
        return true;
    }

    if ((item->flags & DS5_DUAL_FLAG_LATEST) != 0 &&
        xQueueReceive(s_tx_queue, &dropped, 0) == pdPASS) {
        if (dropped.wants_ack) {
            (void)xQueueSendToFront(s_tx_queue, &dropped, 0);
            s_stats.spi_queue_drops++;
            return false;
        }
        s_stats.spi_queue_drops++;
        return xQueueSend(s_tx_queue, item, 0) == pdPASS;
    }

    s_stats.spi_queue_drops++;
    return false;
}

#if CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR
static bool spi_pins_configured(void)
{
    return CONFIG_DS5_DUAL_CHIP_SPI_SCLK_GPIO >= 0 &&
           CONFIG_DS5_DUAL_CHIP_SPI_MOSI_GPIO >= 0 &&
           CONFIG_DS5_DUAL_CHIP_SPI_MISO_GPIO >= 0 &&
           CONFIG_DS5_DUAL_CHIP_SPI_CS_GPIO >= 0;
}

static void set_optional_gpio_level(int gpio_num, int level)
{
    if (gpio_num < 0) {
        return;
    }

    uint64_t gpio_mask = 1ULL << (uint32_t)gpio_num;
    if ((s_output_gpio_configured_mask & gpio_mask) == 0) {
        gpio_config_t cfg = {
            .pin_bit_mask = gpio_mask,
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_ERROR_CHECK(gpio_config(&cfg));
        s_output_gpio_configured_mask |= gpio_mask;
    }
    ESP_ERROR_CHECK(gpio_set_level((gpio_num_t)gpio_num, level));
}

static uint16_t load_u16_le(const uint8_t *src)
{
    return (uint16_t)(src[0] | ((uint16_t)src[1] << 8));
}

static uint32_t load_u32_le(const uint8_t *src)
{
    return (uint32_t)src[0] |
           ((uint32_t)src[1] << 8) |
           ((uint32_t)src[2] << 16) |
           ((uint32_t)src[3] << 24);
}

static uint32_t diag_crc32_update(uint32_t crc, const uint8_t *data, size_t len)
{
    for (size_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            uint32_t mask = 0U - (crc & 1U);
            crc = (crc >> 1) ^ (0xEDB88320U & mask);
        }
    }
    return crc;
}

static uint32_t diag_frame_crc32(const uint8_t *frame, uint16_t payload_len)
{
    uint32_t crc = diag_crc32_update(0xFFFFFFFFU, frame, 16);

