ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
    crc = diag_crc32_update(crc,
                            frame + DS5_DUAL_SPI_HEADER_LEN,
                            payload_len);
    return ~crc;
}

static void log_rejected_frame(const uint8_t *frame, size_t rx_len)
{
    uint32_t log_count = ++s_reject_log_count;
    size_t dump_len = rx_len < 32U ? rx_len : 32U;

    if (log_count > 12U && (log_count % 64U) != 0U) {
        return;
    }
    if (frame == NULL || rx_len < DS5_DUAL_SPI_HEADER_LEN) {
        ESP_LOGW(TAG,
                 "SPI reject diag #%u short rx_len=%u",
                 (unsigned)log_count,
                 (unsigned)rx_len);
        if (frame != NULL && dump_len != 0U) {
            ESP_LOG_BUFFER_HEX_LEVEL(TAG, frame, dump_len, ESP_LOG_WARN);
        }
        return;
    }

    uint16_t magic = load_u16_le(frame + 0);
    uint16_t flags = load_u16_le(frame + 4);
    uint16_t seq = load_u16_le(frame + 8);
    uint16_t payload_len = load_u16_le(frame + 14);
    uint32_t crc_rx = load_u32_le(frame + 16);
    bool len_ok = payload_len <= DS5_DUAL_SPI_MAX_PAYLOAD &&
                  rx_len >= ds5_dual_spi_frame_len(payload_len);
    uint32_t crc_calc = len_ok ? diag_frame_crc32(frame, payload_len) : 0U;

    ESP_LOGW(TAG,
             "SPI reject diag #%u magic=0x%04x ver=%u type=%u flags=0x%04x chan=%u prio=%u seq=%u len=%u len_ok=%d crc_rx=0x%08x crc_calc=0x%08x",
             (unsigned)log_count,
             (unsigned)magic,
             (unsigned)frame[2],
             (unsigned)frame[3],
             (unsigned)flags,
             (unsigned)frame[6],
             (unsigned)frame[7],
             (unsigned)seq,
             (unsigned)payload_len,
             len_ok ? 1 : 0,
             (unsigned)crc_rx,
             (unsigned)crc_calc);
    ESP_LOG_BUFFER_HEX_LEVEL(TAG, frame, dump_len, ESP_LOG_WARN);
}

static void log_transaction_diag(const uint8_t *frame,
                                 size_t rx_len,
                                 size_t trans_bits,
                                 bool had_response)
{
    uint32_t log_count = ++s_transaction_log_count;
    size_t dump_len = rx_len < 32U ? rx_len : 32U;

    if (log_count > 24U && (log_count % 64U) != 0U) {
        return;
    }

    ESP_LOGI(TAG,
             "SPI trans diag #%u bits=%u rx_len=%u had_response=%d first=%02x",
             (unsigned)log_count,
             (unsigned)trans_bits,
             (unsigned)rx_len,
             had_response ? 1 : 0,
             (frame != NULL && rx_len != 0U) ? frame[0] : 0U);
    if (frame != NULL && dump_len != 0U) {
        ESP_LOG_BUFFER_HEX_LEVEL(TAG, frame, dump_len, ESP_LOG_INFO);
    }
}

static uint16_t response_seq_for_type(uint8_t type)
{
    static uint16_t input_seq;
    static uint16_t mic_seq;
    static uint16_t status_seq;

    switch (type) {
    case DS5_DUAL_MSG_BT_RX_INPUT:
        return input_seq++;
    case DS5_DUAL_MSG_BT_RX_MIC_OPUS:
        return mic_seq++;
    case DS5_DUAL_MSG_BT_RX_FEATURE_REPORT:
        return status_seq++;
    default:
            return status_seq++;
    }
}

static uint8_t response_queue_index(uint8_t offset)
{
    return (uint8_t)((s_response_head + offset) %
                     CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH);
}

static bool response_items_match_replace_key(const dual_chip_response_item_t *queued,
                                             const dual_chip_response_item_t *incoming)
{
    if (queued == NULL || incoming == NULL) {
        return false;
    }
    if (queued->type != incoming->type ||
        (queued->flags & DS5_DUAL_FLAG_ACK) != 0 ||
        (incoming->flags & DS5_DUAL_FLAG_ACK) != 0) {
        return false;
    }

    switch (incoming->type) {
    case DS5_DUAL_MSG_BT_RX_FEATURE_REPORT: {
        uint16_t queued_payload_len = load_u16_le(queued->frame + 14);
        uint16_t incoming_payload_len = load_u16_le(incoming->frame + 14);

        if (queued_payload_len < 1U || incoming_payload_len < 1U) {
            return false;
        }
        return queued->frame[DS5_DUAL_SPI_HEADER_LEN] ==
               incoming->frame[DS5_DUAL_SPI_HEADER_LEN];
    }
    default:
        return true;
    }
}

static void response_queue_drop_tail_locked(void)
{
    if (s_response_count == 0) {
        return;
    }

    s_response_count--;
    s_stats.spi_queue_drops++;
}

static bool response_queue_replace_matching_locked(const dual_chip_response_item_t *item)
{
    if (item == NULL) {
        return false;
    }

    for (uint8_t i = 0; i < s_response_count; i++) {
        uint8_t idx = response_queue_index(i);

        if (response_items_match_replace_key(&s_response_queue[idx], item)) {
            s_response_queue[idx] = *item;
            s_stats.spi_queue_drops++;
            return true;
        }
    }

    return false;
}

static bool response_queue_push_back_locked(const dual_chip_response_item_t *item,
                                            bool replace_existing)
{
    uint8_t idx;

    if (item == NULL) {
        return false;
    }
    if (replace_existing && response_queue_replace_matching_locked(item)) {
        return true;
    }
    if (s_response_count >= CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH) {
        if (!replace_existing) {
            return false;
        }
        response_queue_drop_tail_locked();
    }

    idx = response_queue_index(s_response_count);
    s_response_queue[idx] = *item;
    s_response_count++;
    return true;
}

static bool response_queue_push_front_locked(const dual_chip_response_item_t *item)
{
    if (item == NULL) {
        return false;
    }
    if (s_response_count >= CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH) {
        response_queue_drop_tail_locked();
    }

    s_response_head = s_response_head == 0 ?
        (CONFIG_DS5_DUAL_CHIP_RESPONSE_QUEUE_DEPTH - 1) :
        (s_response_head - 1);
    s_response_queue[s_response_head] = *item;
    s_response_count++;
    return true;
}

static bool response_queue_peek_front_locked(dual_chip_response_item_t *item)
{
    if (item == NULL || s_response_count == 0) {
        return false;
    }

    *item = s_response_queue[s_response_head];
    return true;
}

static void response_queue_pop_front_locked(void)
{
    if (s_response_count == 0) {
        return;
    }

    s_response_head = response_queue_index(1);
    s_response_count--;
}

static bool response_queue_consume_matching_front_locked(const dual_chip_response_item_t *item)
{
    const dual_chip_response_item_t *head;

