ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
    if (item == NULL || s_response_count == 0) {
        return false;
    }

    head = &s_response_queue[s_response_head];
    if (head->type != item->type ||
        head->flags != item->flags ||
        head->len != item->len ||
        memcmp(head->frame, item->frame, item->len) != 0) {
        return false;
    }

    response_queue_pop_front_locked();
    return true;
}

static bool set_pending_response_with_flags(uint8_t type,
                                            uint16_t flags,
                                            uint8_t channel,
                                            uint8_t priority,
                                            uint32_t timestamp_us,
                                            const uint8_t *payload,
                                            size_t payload_len,
                                            bool replace_existing)
{
    ds5_dual_spi_header_t header;
    dual_chip_response_item_t item;
    bool queued;

    if (payload == NULL || payload_len == 0 || payload_len > DS5_DUAL_SPI_MAX_PAYLOAD) {
        return false;
    }

    memset(&item, 0, sizeof(item));
    item.type = type;
    item.flags = flags;
    item.len = ds5_dual_spi_frame_len((uint16_t)payload_len);
    ds5_dual_spi_header_init(&header,
                             type,
                             flags,
                             channel,
                             priority,
                             response_seq_for_type(type),
                             timestamp_us,
                             (uint16_t)payload_len);
    if (!ds5_dual_spi_finalize_frame(item.frame, sizeof(item.frame), &header, payload)) {
        s_stats.spi_crc_errors++;
        return false;
    }

    if (s_response_lock != NULL) {
        xSemaphoreTake(s_response_lock, portMAX_DELAY);
    }
    queued = ((flags & DS5_DUAL_FLAG_ACK) != 0 ||
              type == DS5_DUAL_MSG_HELLO ||
              type == DS5_DUAL_MSG_TIME_SYNC ||
              type == DS5_DUAL_MSG_STATS ||
              type == DS5_DUAL_MSG_FLOW_CREDIT) ?
        response_queue_push_front_locked(&item) :
        response_queue_push_back_locked(&item, replace_existing);
    if (s_response_lock != NULL) {
        xSemaphoreGive(s_response_lock);
    }

    if (!queued) {
        return false;
    }
    set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO, 1);
    return true;
}

static bool set_pending_response(uint8_t type,
                                 uint8_t channel,
                                 uint8_t priority,
                                 uint32_t timestamp_us,
                                 const uint8_t *payload,
                                 size_t payload_len,
                                 bool replace_existing)
{
    return set_pending_response_with_flags(type,
                                           DS5_DUAL_FLAG_LATEST | DS5_DUAL_FLAG_DROP_OK,
                                           channel,
                                           priority,
                                           timestamp_us,
                                           payload,
                                           payload_len,
                                           replace_existing);
}

static void set_pending_ack_fields(uint16_t seq,
                                   uint8_t type,
                                   uint8_t channel,
                                   int32_t status)
{
    ds5_dual_ack_t ack;
    uint8_t payload[DS5_DUAL_ACK_PAYLOAD_LEN];

    ack.seq = seq;
    ack.type = type;
    ack.status = status;
    if (!ds5_dual_ack_encode(&ack, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response_with_flags(type,
                                        DS5_DUAL_FLAG_ACK,
                                        channel,
                                        DS5_DUAL_PRIORITY_CONTROL,
                                        (uint32_t)esp_timer_get_time(),
                                        payload,
                                        sizeof(payload),
                                        false)) {
        s_stats.ack_tx++;
    } else {
        s_stats.ack_drops++;
    }
}

static void set_pending_ack(const ds5_dual_spi_header_t *request, int32_t status)
{
    if (request == NULL) {
        return;
    }

    set_pending_ack_fields(request->seq, request->type, request->channel, status);
}

static void set_pending_flow_credit(void)
{
    ds5_dual_flow_credit_t credit = {
        .tx_queue_free = s_tx_queue != NULL ?
            (uint8_t)uxQueueSpacesAvailable(s_tx_queue) :
            0,
        .tx_queue_depth = CONFIG_DS5_DUAL_CHIP_TX_QUEUE_DEPTH,
        .bt_ready = bt_dualsense_raw_hidp_ready(),
        .spi_queue_drops = s_stats.spi_queue_drops,
        .hidp_tx_errors = s_stats.hidp_tx_errors,
        .hidp_last_err = s_stats.hidp_last_err,
    };
    uint8_t payload[DS5_DUAL_FLOW_CREDIT_PAYLOAD_LEN];

    if (!ds5_dual_flow_credit_encode(&credit, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response(DS5_DUAL_MSG_FLOW_CREDIT,
                             DS5_DUAL_CHANNEL_STATUS,
                             DS5_DUAL_PRIORITY_CONTROL,
                             (uint32_t)esp_timer_get_time(),
                             payload,
                             sizeof(payload),
                             false)) {
        s_stats.flow_credit_tx++;
    }
}

static void set_pending_stats(void)
{
    ds5_dual_stats_t stats = {
        .protocol_version = DS5_DUAL_SPI_VERSION,
        .role = DS5_DUAL_ROLE_ESP32_BT,
        .uptime_us = (uint32_t)esp_timer_get_time(),
        .spi_rx_frames = s_stats.spi_rx_frames,
        .spi_tx_frames = s_stats.spi_tx_frames,
        .spi_crc_errors = s_stats.spi_crc_errors,
        .spi_queue_drops = s_stats.spi_queue_drops,
        .hidp_tx_31 = s_stats.hidp_tx_31,
        .hidp_tx_32 = s_stats.hidp_tx_32,
        .hidp_tx_36 = s_stats.hidp_tx_36,
        .hidp_tx_feature_get = s_stats.hidp_tx_feature_get,
        .hidp_tx_feature_set = s_stats.hidp_tx_feature_set,
        .hidp_tx_errors = s_stats.hidp_tx_errors,
        .deadline_miss_36 = s_stats.deadline_miss_36,
        .hidp_rx_input = s_stats.hidp_rx_input,
        .hidp_rx_mic_opus = s_stats.hidp_rx_mic_opus,
        .hidp_rx_feature_report = s_stats.hidp_rx_feature_report,
        .ack_tx = s_stats.ack_tx,
        .ack_drops = s_stats.ack_drops,
        .flow_credit_tx = s_stats.flow_credit_tx,
        .bt_connect_rx = s_stats.bt_connect_rx,
        .bt_disconnect_rx = s_stats.bt_disconnect_rx,
    };
    uint8_t payload[DS5_DUAL_STATS_PAYLOAD_LEN];

    if (!ds5_dual_stats_encode(&stats, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response(DS5_DUAL_MSG_STATS,
                             DS5_DUAL_CHANNEL_STATUS,
                             DS5_DUAL_PRIORITY_LOW,
                             stats.uptime_us,
                             payload,
                             sizeof(payload),
                             true)) {
        s_stats.stats_tx++;
    } else {
        s_stats.stats_drops++;
    }
}

