ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
static void set_pending_hello(void)
{
    ds5_dual_hello_t hello = {
        .protocol_version = DS5_DUAL_SPI_VERSION,
        .role = DS5_DUAL_ROLE_ESP32_BT,
        .header_len = DS5_DUAL_SPI_HEADER_LEN,
        .max_payload = DS5_DUAL_SPI_MAX_PAYLOAD,
        .spi_mtu = DS5_DUAL_CHIP_SPI_TRANSACTION_LEN,
        .tx_queue_depth = CONFIG_DS5_DUAL_CHIP_TX_QUEUE_DEPTH,
        .capabilities = DS5_DUAL_CAP_BT_HIDP_RAW |
                        DS5_DUAL_CAP_AUDIO_RT |
                        DS5_DUAL_CAP_FEATURE_REPORTS |
                        DS5_DUAL_CAP_FLOW_CREDIT |
                        DS5_DUAL_CAP_RELIABLE_ACK |
                        DS5_DUAL_CAP_BT_CONNECT_MODES,
    };
    uint8_t payload[DS5_DUAL_HELLO_PAYLOAD_LEN];

    if (!ds5_dual_hello_encode(&hello, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response(DS5_DUAL_MSG_HELLO,
                             DS5_DUAL_CHANNEL_CTRL,
                             DS5_DUAL_PRIORITY_CONTROL,
                             (uint32_t)esp_timer_get_time(),
                             payload,
                             sizeof(payload),
                             false)) {
        s_stats.hello_tx++;
    }
}

static void set_pending_time_sync(const ds5_dual_time_sync_t *request)
{
    ds5_dual_time_sync_t sync;
    uint8_t payload[DS5_DUAL_TIME_SYNC_PAYLOAD_LEN];

    if (request == NULL) {
        return;
    }

    sync = *request;
    sync.esp_time_us = (uint32_t)esp_timer_get_time();
    sync.roundtrip_us = 0;
    sync.offset_us = 0;
    if (!ds5_dual_time_sync_encode(&sync, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response(DS5_DUAL_MSG_TIME_SYNC,
                             DS5_DUAL_CHANNEL_CTRL,
                             DS5_DUAL_PRIORITY_CONTROL,
                             sync.esp_time_us,
                             payload,
                             sizeof(payload),
                             false)) {
        s_stats.time_sync_tx++;
    }
}

static void set_pending_bt_state(const bt_dualsense_raw_hidp_state_t *raw_state,
                                 int64_t timestamp_us)
{
    ds5_dual_bt_state_t state;
    uint8_t payload[DS5_DUAL_BT_STATE_PAYLOAD_LEN];

    if (raw_state == NULL) {
        return;
    }

    memset(&state, 0, sizeof(state));
    state.flags = raw_state->flags;
    state.last_error = raw_state->last_error;
    state.rssi = raw_state->rssi;
    state.bringup_attempts = raw_state->bringup_attempts;
    state.reconnect_failures = raw_state->reconnect_failures;
    state.control_mtu = raw_state->control_mtu;
    state.interrupt_mtu = raw_state->interrupt_mtu;
    memcpy(state.bda, raw_state->bda, sizeof(state.bda));
    state.state_seq = raw_state->state_seq;
    if (!ds5_dual_bt_state_encode(&state, payload, sizeof(payload))) {
        s_stats.spi_crc_errors++;
        return;
    }

    if (set_pending_response(DS5_DUAL_MSG_BT_STATE,
                             DS5_DUAL_CHANNEL_STATUS,
                             DS5_DUAL_PRIORITY_CONTROL,
                             (uint32_t)timestamp_us,
                             payload,
                             sizeof(payload),
                             true)) {
        s_stats.bt_state_tx++;
    } else {
        s_stats.bt_state_drops++;
    }
}

static bool stage_response_for_transaction(dual_chip_response_item_t *item,
                                          size_t *response_len)
{
    bool valid = false;
    bool dropped = false;
    uint8_t queued_after = 0;

    /* Keep the queued item in place until the slave transaction succeeds. */
    memset(s_spi_tx_buf, 0, sizeof(s_spi_tx_buf));
    if (s_response_lock != NULL) {
        xSemaphoreTake(s_response_lock, portMAX_DELAY);
    }
    valid = response_queue_peek_front_locked(item);
    if (valid && item->len <= sizeof(s_spi_tx_buf)) {
        memcpy(s_spi_tx_buf, item->frame, item->len);
        if (response_len != NULL) {
            *response_len = item->len;
        }
    } else if (valid) {
        response_queue_pop_front_locked();
        s_stats.spi_queue_drops++;
        queued_after = s_response_count;
        dropped = true;
        valid = false;
    }
    if (s_response_lock != NULL) {
        xSemaphoreGive(s_response_lock);
    }

    if (!valid && response_len != NULL) {
        *response_len = 0;
    }
    if (dropped) {
        set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO,
                                queued_after > 0 ? 1 : 0);
    }
    return valid;
}

static void finish_response_transaction(const dual_chip_response_item_t *item, bool success)
{
    uint8_t queued_after;

    if (s_response_lock != NULL) {
        xSemaphoreTake(s_response_lock, portMAX_DELAY);
    }
    if (success) {
        (void)response_queue_consume_matching_front_locked(item);
    }
    queued_after = s_response_count;
    if (s_response_lock != NULL) {
        xSemaphoreGive(s_response_lock);
    }

    set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO,
                            queued_after > 0 ? 1 : 0);
}

static void rx_forward_cb(const uint8_t *data, size_t len, int64_t timestamp_us, void *ctx)
{
    dualsense_state_t state;
    dualsense_parse_result_t parse = {0};

    (void)ctx;

    if (data != NULL && len >= 3 && data[0] == 0xA3) {
        s_stats.hidp_rx_feature_report++;
        set_pending_response(DS5_DUAL_MSG_BT_RX_FEATURE_REPORT,
                             DS5_DUAL_CHANNEL_CTRL,
                             DS5_DUAL_PRIORITY_CONTROL,
                             (uint32_t)timestamp_us,
                             data + 1,
                             len - 1U,
                             true);
        return;
    }

    if (dualsense_parse_report(data, len, &state, &parse)) {
        s_stats.hidp_rx_input++;
        set_pending_response(DS5_DUAL_MSG_BT_RX_INPUT,
                             DS5_DUAL_CHANNEL_INPUT,
                             DS5_DUAL_PRIORITY_RT,
                             (uint32_t)timestamp_us,
                             data,
                             len,
                             true);
    } else if (parse.kind == DS5_REPORT_MIC_AUDIO) {
        s_stats.hidp_rx_mic_opus++;
        if (parse.payload_len > 1U && parse.payload_offset + parse.payload_len <= len) {
            set_pending_response(DS5_DUAL_MSG_BT_RX_MIC_OPUS,
                                 DS5_DUAL_CHANNEL_AUDIO,
                                 DS5_DUAL_PRIORITY_AUDIO,
                                 (uint32_t)timestamp_us,
                                 data + parse.payload_offset + 1U,
                                 parse.payload_len - 1U,
                                 true);
        }
    }
}

static void state_forward_cb(const bt_dualsense_raw_hidp_state_t *state,
                             int64_t timestamp_us,
                             void *ctx)
{
    (void)ctx;
    set_pending_bt_state(state, timestamp_us);
}

static void tx_task(void *arg)
{
    dual_chip_tx_item_t item;

    (void)arg;

    while (true) {
        if (xQueueReceive(s_tx_queue, &item, portMAX_DELAY) != pdPASS) {
            continue;
        }

        if (item.deadline_us != 0 &&
            esp_timer_get_time() > (int64_t)item.deadline_us) {
            if (item.type == DS5_DUAL_MSG_BT_TX_AUDIO_RT ||
                (item.len > 0 && item.payload[0] == 0x39)) {
                s_stats.deadline_miss_36++;
            }
            if (item.wants_ack) {
                set_pending_ack_fields(item.ack_seq, item.type, item.channel, -ETIMEDOUT);
            }
            set_pending_flow_credit();
            continue;
        }

        int err;
        if (item.type == DS5_DUAL_MSG_BT_TX_FEATURE_GET) {
            if (item.len < 1U) {
                err = -EINVAL;
            } else {
                err = bt_dualsense_raw_hidp_get_feature(item.payload[0]);
            }
        } else if (item.type == DS5_DUAL_MSG_BT_TX_FEATURE_SET) {
            if (item.len < 1U) {
                err = -EINVAL;
            } else {
                err = bt_dualsense_raw_hidp_set_feature(item.payload[0],
                                                        item.payload + 1,
                                                        item.len - 1U);
            }
        } else {
            err = bt_dualsense_raw_hidp_send_report(
                item.payload,
                item.len,
                item.type == DS5_DUAL_MSG_BT_TX_AUDIO_RT);
        }
        if (err) {
            s_stats.hidp_tx_errors++;
            s_stats.hidp_last_err = err;
            ESP_LOGW(TAG, "HIDP tx from SPI failed type=%s len=%u err=%d",
                     ds5_dual_spi_type_name(item.type),
                     (unsigned)item.len,
                     err);
        } else if ((item.type == DS5_DUAL_MSG_BT_TX_REPORT ||
                    item.type == DS5_DUAL_MSG_BT_TX_AUDIO_RT) &&
                   item.len > 0) {
            s_stats.hidp_last_err = 0;
        } else {
            s_stats.hidp_last_err = 0;
        }
        if (item.wants_ack) {
            set_pending_ack_fields(item.ack_seq, item.type, item.channel, err);
        }
        set_pending_flow_credit();
    }
}

