ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
static esp_err_t init_spi_slave(void)
{
    spi_bus_config_t buscfg = {
        .mosi_io_num = CONFIG_DS5_DUAL_CHIP_SPI_MOSI_GPIO,
        .miso_io_num = CONFIG_DS5_DUAL_CHIP_SPI_MISO_GPIO,
        .sclk_io_num = CONFIG_DS5_DUAL_CHIP_SPI_SCLK_GPIO,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = DS5_DUAL_CHIP_SPI_TRANSACTION_LEN,
    };
    spi_slave_interface_config_t slvcfg = {
        .spics_io_num = CONFIG_DS5_DUAL_CHIP_SPI_CS_GPIO,
        .flags = 0,
        .queue_size = 3,
        .mode = 0,
    };

    return spi_slave_initialize((spi_host_device_t)CONFIG_DS5_DUAL_CHIP_SPI_HOST,
                                &buscfg,
                                &slvcfg,
                                SPI_DMA_CH_AUTO);
}

static void spi_task(void *arg)
{
    (void)arg;

    esp_err_t err = init_spi_slave();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SPI slave init failed: %s", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }

    set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO, 0);
    set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO, 0);
    ESP_LOGI(TAG,
             "SPI slave ready host=%d sclk=%d mosi=%d miso=%d cs=%d ready=%d irq=%d mtu=%u",
             CONFIG_DS5_DUAL_CHIP_SPI_HOST,
             CONFIG_DS5_DUAL_CHIP_SPI_SCLK_GPIO,
             CONFIG_DS5_DUAL_CHIP_SPI_MOSI_GPIO,
             CONFIG_DS5_DUAL_CHIP_SPI_MISO_GPIO,
             CONFIG_DS5_DUAL_CHIP_SPI_CS_GPIO,
             CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO,
             CONFIG_DS5_DUAL_CHIP_ESP_IRQ_GPIO,
             (unsigned)DS5_DUAL_CHIP_SPI_TRANSACTION_LEN);

    set_pending_hello();

    while (true) {
        spi_slave_transaction_t trans = {0};
        dual_chip_response_item_t response_item = {0};
        size_t response_len = 0;
        bool had_response = stage_response_for_transaction(&response_item, &response_len);

        memset(s_spi_rx_buf, 0, sizeof(s_spi_rx_buf));
        trans.length = sizeof(s_spi_rx_buf) * 8U;
        trans.tx_buffer = s_spi_tx_buf;
        trans.rx_buffer = s_spi_rx_buf;

        set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO, 1);
        err = spi_slave_transmit((spi_host_device_t)CONFIG_DS5_DUAL_CHIP_SPI_HOST,
                                 &trans,
                                 portMAX_DELAY);
        set_optional_gpio_level(CONFIG_DS5_DUAL_CHIP_ESP_READY_GPIO, 0);
        if (err != ESP_OK) {
            s_stats.spi_crc_errors++;
            ESP_LOGW(TAG, "SPI slave transaction failed: %s", esp_err_to_name(err));
            continue;
        }

        if (had_response) {
            s_stats.spi_tx_frames++;
            finish_response_transaction(&response_item, true);
            (void)response_len;
        }

        size_t rx_len = trans.trans_len > 0 ?
            (size_t)(trans.trans_len / 8U) :
            sizeof(s_spi_rx_buf);
        log_transaction_diag(s_spi_rx_buf, rx_len, trans.trans_len, had_response);
        if (rx_len >= DS5_DUAL_SPI_HEADER_LEN &&
            s_spi_rx_buf[0] != 0 &&
            esp32_dual_chip_spi_handle_frame(s_spi_rx_buf, rx_len) != ESP_OK) {
            log_rejected_frame(s_spi_rx_buf, rx_len);
        }
    }
}
#else
static void set_pending_ack(const ds5_dual_spi_header_t *request, int32_t status)
{
    (void)request;
    (void)status;
}

static void set_pending_hello(void)
{
}

static void set_pending_flow_credit(void)
{
}

static void set_pending_stats(void)
{
}

static void set_pending_time_sync(const ds5_dual_time_sync_t *request)
{
    (void)request;
}

#endif

esp_err_t esp32_dual_chip_spi_start(void)
{
#if CONFIG_DS5_DUAL_CHIP_SPI_COPROCESSOR
    if (s_tx_queue == NULL) {
        s_tx_queue = xQueueCreate(CONFIG_DS5_DUAL_CHIP_TX_QUEUE_DEPTH,
                                  sizeof(dual_chip_tx_item_t));
        if (s_tx_queue == NULL) {
            return ESP_ERR_NO_MEM;
        }
    }

    if (s_response_lock == NULL) {
        s_response_lock = xSemaphoreCreateMutex();
        if (s_response_lock == NULL) {
            return ESP_ERR_NO_MEM;
        }
    }

    if (s_tx_task == NULL) {
        BaseType_t ok = xTaskCreatePinnedToCore(tx_task,
                                                "ds5_spi_tx",
                                                DS5_DUAL_CHIP_TASK_STACK,
                                                NULL,
                                                6,
                                                &s_tx_task,
                                                1);
        if (ok != pdPASS) {
            s_tx_task = NULL;
            return ESP_ERR_NO_MEM;
        }
    }

    bt_dualsense_raw_hidp_set_rx_callback(rx_forward_cb, NULL);
    bt_dualsense_raw_hidp_set_state_callback(state_forward_cb, NULL);
    if (spi_pins_configured()) {
        if (s_spi_task == NULL) {
            BaseType_t ok = xTaskCreatePinnedToCore(spi_task,
                                                    "ds5_spi_slave",
                                                    DS5_DUAL_CHIP_SPI_TASK_STACK,
                                                    NULL,
                                                    7,
                                                    &s_spi_task,
                                                    1);
            if (ok != pdPASS) {
                s_spi_task = NULL;
                return ESP_ERR_NO_MEM;
            }
        }
    } else {
        ESP_LOGW(TAG,
                 "Dual-chip SPI queue enabled but hardware pins are unset; configure SCLK/MOSI/MISO/CS GPIOs before wiring test");
    }
#else
    ESP_LOGI(TAG, "Dual-chip SPI coprocessor disabled by config");
#endif
    return ESP_OK;
}

esp_err_t esp32_dual_chip_spi_handle_frame(const uint8_t *frame, size_t frame_len)
{
    ds5_dual_spi_header_t header;
    dual_chip_tx_item_t item;
    const uint8_t *payload;
    bool wants_ack;

    if (frame == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!ds5_dual_spi_validate_frame(frame, frame_len, &header)) {
        s_stats.spi_crc_errors++;
        return ESP_ERR_INVALID_CRC;
    }

    s_stats.spi_rx_frames++;
    ESP_LOGI(TAG,
             "SPI rx valid type=%s seq=%u len=%u flags=0x%04x",
             ds5_dual_spi_type_name(header.type),
             (unsigned)header.seq,
             (unsigned)header.length,
             (unsigned)header.flags);
    payload = frame + DS5_DUAL_SPI_HEADER_LEN;
    wants_ack = (header.flags & DS5_DUAL_FLAG_RELIABLE) != 0;

    if (header.type == DS5_DUAL_MSG_HELLO) {
        ds5_dual_hello_t hello;

        if (!ds5_dual_hello_decode(payload, header.length, &hello)) {
            if (wants_ack) {
                set_pending_ack(&header, -EINVAL);
            }
            return ESP_ERR_INVALID_ARG;
        }
        s_stats.hello_rx++;
        s_stats.peer_role = hello.role;
        s_stats.peer_protocol_version = hello.protocol_version;
        s_stats.peer_max_payload = hello.max_payload;
        s_stats.peer_spi_mtu = hello.spi_mtu;
        s_stats.peer_tx_queue_depth = hello.tx_queue_depth;
        s_stats.peer_capabilities = hello.capabilities;
        if (wants_ack) {
            set_pending_ack(&header, 0);
        }
        set_pending_hello();
        return ESP_OK;
    }
    if (header.type == DS5_DUAL_MSG_TIME_SYNC) {
        ds5_dual_time_sync_t sync;

