ccc007ccc/DS5Dongle/main/esp32_dual_chip_spi.c
        if (!ds5_dual_time_sync_decode(payload, header.length, &sync)) {
            if (wants_ack) {
                set_pending_ack(&header, -EINVAL);
            }
            return ESP_ERR_INVALID_ARG;
        }
        s_stats.time_sync_rx++;
        set_pending_time_sync(&sync);
        if (wants_ack) {
            set_pending_ack(&header, 0);
        }
        return ESP_OK;
    }
    if (header.type == DS5_DUAL_MSG_RESET_STATS) {
        esp32_dual_chip_spi_reset_stats();
        if (wants_ack) {
            set_pending_ack(&header, 0);
        }
        return ESP_OK;
    }
    if (header.type == DS5_DUAL_MSG_STATS) {
        if (header.length != 0) {
            if (wants_ack) {
                set_pending_ack(&header, -EINVAL);
            }
            return ESP_ERR_INVALID_SIZE;
        }
        s_stats.stats_rx++;
        set_pending_stats();
        if (wants_ack) {
            set_pending_ack(&header, 0);
        }
        return ESP_OK;
    }
    if (header.type == DS5_DUAL_MSG_WIRE_TEST) {
        int status = 0;

        if (header.length < 1U) {
            status = -EINVAL;
        } else if (payload[0] == DS5_DUAL_WIRE_TEST_START) {
            led_status_set(DS5_LED_STATE_WIRE_TESTING);
        } else if (payload[0] == DS5_DUAL_WIRE_TEST_PASS) {
            led_status_set(DS5_LED_STATE_WIRE_TEST_PASS);
        } else if (payload[0] == DS5_DUAL_WIRE_TEST_FAIL) {
            led_status_set(DS5_LED_STATE_WIRE_TEST_FAIL);
        } else {
            status = -EINVAL;
        }
        if (wants_ack) {
            set_pending_ack(&header, status);
        }
        return status == 0 ? ESP_OK : ESP_ERR_INVALID_ARG;
    }
    if (header.type == DS5_DUAL_MSG_BT_CONNECT) {
        int status;

        if (header.length == 0) {
            status = bt_dualsense_raw_hidp_connect(NULL, 0, DS5_DUAL_BT_CONNECT_AUTO);
        } else if (header.length == 1U) {
            status = bt_dualsense_raw_hidp_connect(NULL, 0, payload[0]);
        } else if (header.length == 6U) {
            status = bt_dualsense_raw_hidp_connect(payload, header.length,
                                                   DS5_DUAL_BT_CONNECT_AUTO);
        } else {
            status = -EINVAL;
        }
        if ((status == 0 || status == -EAGAIN) &&
            (header.length == 0 || header.length == 1U || header.length == 6U)) {
            s_stats.bt_connect_rx++;
        }
        if (wants_ack) {
            set_pending_ack(&header, status);
        }
        set_pending_flow_credit();
        return status == 0 || status == -EAGAIN ? ESP_OK : ESP_ERR_INVALID_ARG;
    }
    if (header.type == DS5_DUAL_MSG_BT_DISCONNECT) {
        bool allow_reconnect = header.length > 0 && payload[0] != 0;
        int status = header.length > 1U ?
            -EINVAL :
            bt_dualsense_raw_hidp_disconnect(allow_reconnect);

        if (status == 0) {
            s_stats.bt_disconnect_rx++;
        }
        if (wants_ack) {
            set_pending_ack(&header, status);
        }
        set_pending_flow_credit();
        return status == 0 ? ESP_OK : ESP_ERR_INVALID_ARG;
    }
    if (header.type == DS5_DUAL_MSG_BT_FORGET) {
        int status = header.length == 1U ?
            bt_dualsense_raw_hidp_forget(payload[0]) :
            -EINVAL;

        if (wants_ack) {
            set_pending_ack(&header, status);
        }
        set_pending_flow_credit();
        return status == 0 ? ESP_OK : ESP_ERR_INVALID_ARG;
    }
    if (header.type != DS5_DUAL_MSG_BT_TX_REPORT &&
        header.type != DS5_DUAL_MSG_BT_TX_AUDIO_RT &&
        header.type != DS5_DUAL_MSG_BT_TX_FEATURE_GET &&
        header.type != DS5_DUAL_MSG_BT_TX_FEATURE_SET) {
        if (wants_ack) {
            set_pending_ack(&header, -ENOTSUP);
        }
        return ESP_OK;
    }
    if (header.length == 0 || header.length > sizeof(item.payload)) {
        if (wants_ack) {
            set_pending_ack(&header, -EMSGSIZE);
        }
        return ESP_ERR_INVALID_SIZE;
    }

    memset(&item, 0, sizeof(item));
    item.type = header.type;
    item.flags = header.flags;
    item.channel = header.channel;
    item.priority = header.priority;
    item.ack_seq = header.seq;
    item.deadline_us = header.deadline;
    item.len = header.length;
    item.wants_ack = wants_ack;
    memcpy(item.payload, payload, header.length);

    if (!enqueue_latest(&item)) {
        if (wants_ack) {
            set_pending_ack(&header, -ENOMEM);
        }
        set_pending_flow_credit();
        return ESP_ERR_NO_MEM;
    }
    set_pending_flow_credit();
    return ESP_OK;
}

void esp32_dual_chip_spi_get_stats(esp32_dual_chip_spi_stats_t *stats)
{
    if (stats != NULL) {
        *stats = s_stats;
    }
}

void esp32_dual_chip_spi_reset_stats(void)
{
    memset(&s_stats, 0, sizeof(s_stats));
}
